import pandas as pd

In [32]:
import pandas as pd
import numpy as np

Handling missing Data

In [2]:
df=pd.read_excel('Student Grades.xlsx')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86 entries, 0 to 85
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Student  84 non-null     object
 1   Class    83 non-null     object
 2   Year     80 non-null     object
 3   Grade    82 non-null     float64
dtypes: float64(1), object(3)
memory usage: 2.8+ KB

In [30]:
df.isna().sum()

Student    0
Class      0
Year       0
Grade      0
dtype: int64

In [4]:
df[df.isna().any(axis=1)]

    Student                      Class    Year  Grade
7     Jacob           Freshman Seminar     NaN   88.0
8   William           Freshman Seminar     NaN   89.0
9     Ethan           Freshman Seminar     NaN   86.0
62   Landon  Exploratory Data Analysis  Junior    NaN
81      NaN                        NaN     NaN    NaN
82  Bennett                        NaN     NaN    NaN
83      NaN                        EDA  Junior   84.0
84    Gavin                        EDA  Senior    NaN
85   Calvin                        NaN     NaN  100.0

In [6]:
df.Year.value_counts(dropna=False)

Year
Freshman     35
Sophomore    24
Junior       20
NaN           6
Senior        1
Name: count, dtype: int64

In [42]:
# using drop na
df.dropna()

    Student             Class      Year  Grade
0      Emma  Freshman Seminar  Freshman   86.0
1    Olivia  Freshman Seminar  Freshman   86.0
2      Noah  Freshman Seminar  Freshman   86.0
3    Sophia  Freshman Seminar  Freshman   87.0
4      Liam  Freshman Seminar  Freshman   90.0
..      ...               ...       ...    ...
76     Zoey               EDA    Junior   91.0
77    Aaron               EDA    Junior   85.0
78  Charles               EDA    Junior   93.0
79   Connor               EDA    Junior   91.0
80    Riley               EDA    Junior   87.0

[77 rows x 4 columns]

In [7]:
# using How
df.dropna(how='all')

    Student             Class      Year  Grade
0      Emma  Freshman Seminar  Freshman   86.0
1    Olivia  Freshman Seminar  Freshman   86.0
2      Noah  Freshman Seminar  Freshman   86.0
3    Sophia  Freshman Seminar  Freshman   87.0
4      Liam  Freshman Seminar  Freshman   90.0
..      ...               ...       ...    ...
80    Riley               EDA    Junior   87.0
82  Bennett               NaN       NaN    NaN
83      NaN               EDA    Junior   84.0
84    Gavin               EDA    Senior    NaN
85   Calvin               NaN       NaN  100.0

[85 rows x 4 columns]

In [8]:
# Threh method
df.dropna(thresh=2)

   Student             Class      Year  Grade
0     Emma  Freshman Seminar  Freshman   86.0
1   Olivia  Freshman Seminar  Freshman   86.0
2     Noah  Freshman Seminar  Freshman   86.0
3   Sophia  Freshman Seminar  Freshman   87.0
4     Liam  Freshman Seminar  Freshman   90.0
..     ...               ...       ...    ...
79  Connor               EDA    Junior   91.0
80   Riley               EDA    Junior   87.0
83     NaN               EDA    Junior   84.0
84   Gavin               EDA    Senior    NaN
85  Calvin               NaN       NaN  100.0

[84 rows x 4 columns]

In [25]:

# subset method
df.dropna(subset=['Student','Class'],inplace=True)

In [ ]:
#Each of the methods above gave different results depending on what you are looking for.

How to handle missind values

In [26]:
#filling with mean value
df.Grade.fillna(df.Grade.mean().round(2))

0     86.0
1     86.0
2     86.0
3     87.0
4     90.0
      ...
76    91.0
77    85.0
78    93.0
79    91.0
80    87.0
Name: Grade, Length: 80, dtype: float64

In [12]:
df.Grade.isna()

0     False
1     False
2     False
3     False
4     False
      ...
78    False
79    False
80    False
83    False
85    False
Name: Grade, Length: 82, dtype: bool

In [27]:
df[df.isna().any(axis=1)]

Empty DataFrame
Columns: [Student, Class, Year, Grade]
Index: []

In [28]:
df.fillna({'Year':'Freshman'},inplace=True)

In [29]:
df

    Student             Class      Year  Grade
0      Emma  Freshman Seminar  Freshman   86.0
1    Olivia  Freshman Seminar  Freshman   86.0
2      Noah  Freshman Seminar  Freshman   86.0
3    Sophia  Freshman Seminar  Freshman   87.0
4      Liam  Freshman Seminar  Freshman   90.0
..      ...               ...       ...    ...
76     Zoey               EDA    Junior   91.0
77    Aaron               EDA    Junior   85.0
78  Charles               EDA    Junior   93.0
79   Connor               EDA    Junior   91.0
80    Riley               EDA    Junior   87.0

[80 rows x 4 columns]

In [34]:
#replacing EDA with Exploratory data Analysis
df.Class=np.where(df.Class=='EDA','Exploratory Data Analysis',df.Class)

df.Class.value_counts()

In [36]:
df.Class=np.where(df.Class=='Python','Intro to Python',df.Class)

In [42]:
df.Grade.describe()

count     80.000000
mean      85.550000
std       15.638236
min       45.000000
25%       80.750000
50%       85.000000
75%       90.000000
max      200.000000
Name: Grade, dtype: float64

In [57]:
df.Grade=pd.to_numeric(df.Grade)

In [58]:
df.Grade.describe()

count     80.00000
mean      84.30000
std        8.93351
min       45.00000
25%       80.75000
50%       85.00000
75%       90.00000
max      100.00000
Name: Grade, dtype: float64